#ifndef __BOARD_H__
#define __BOARD_H__

#include "../ConstEnums.h"
#include "../Sexy.TodLib/DataArray.h"
#include "../SexyAppFramework/Widget.h"
#include "../SexyAppFramework/ButtonListener.h"

#include "Plant.h"
#include "Zombie.h"
#include "Projectile.h"
#include "Coin.h"
#include "LawnMower.h"
#include "GridItem.h"

using namespace Sexy;

#define MAX_GRID_SIZE_X 9
#define MAX_GRID_SIZE_Y 6
#define MAX_ZOMBIES_IN_WAVE 50
#define MAX_ZOMBIE_WAVES 100
#define MAX_GRAVE_STONES MAX_GRID_SIZE_X *MAX_GRID_SIZE_Y
#define MAX_POOL_GRID_SIZE 10
#define MAX_RENDER_ITEMS 2048
#define PROGRESS_METER_COUNTER 150
#define MAX_PLANTS_SIZE 1024U
#define MAX_ZOMBIES_SIZE 1024U
#define MAX_PROJECTILE_SIZE 1024U
#define MAX_COIN_SIZE 1024U
#define MAX_LAWN_MOWER_SIZE 32U
#define MAX_GRID_ITEM_SIZE 128U

class LawnApp;
class CursorObject;
class CursorPreview;
class GameButton;
class MessageWidget;
class SeedBank;
class ToolTipWidget;
class CutScene;
class Challenge;
class Reanimation;
class DataSync;
class TodParticleSystem;
namespace Sexy
{
class Graphics;
class ButtonWidget;
class WidgetManager;
class Image;
class MTRand;
} // namespace Sexy

class HitResult
{
  public:
	void *mObject;
	GameObjectType mObjectType;
};

class RenderItem
{
  public:
	RenderObjectType mRenderObjectType;
	int mZPos;
	union {
		GameObject *mGameObject;
		Plant *mPlant;
		Zombie *mZombie;
		Coin *mCoin;
		Projectile *mProjectile;
		CursorPreview *mCursorPreview;
		TodParticleSystem *mParticleSytem;
		Reanimation *mReanimation;
		GridItem *mGridItem;
		LawnMower *mMower;
		BossPart mBossPart;
		int mBoardGridY;
	};
};
bool RenderItemSortFunc(const RenderItem &theItem1, const RenderItem &theItem2);

struct ZombiePicker
{
	int mZombieCount;
	int mZombiePoints;
	int mZombieTypeCount[NUM_ZOMBIE_TYPES];
	int mAllWavesZombieTypeCount[NUM_ZOMBIE_TYPES];
};

/*inline*/ void ZombiePickerInitForWave(ZombiePicker *theZombiePicker);
/*inline*/ void ZombiePickerInit(ZombiePicker *theZombiePicker);

struct PlantsOnLawn
{
	Plant *mUnderPlant;
	Plant *mPumpkinPlant;
	Plant *mFlyingPlant;
	Plant *mNormalPlant;
};

struct BungeeDropGrid
{
	TodWeightedGridArray mGridArray[MAX_GRID_SIZE_X * MAX_GRID_SIZE_Y];
	int mGridArrayCount;
};

class Board : public Widget, public ButtonListener
{
  public:
	LawnApp *mApp;													  //+0x8C
	DataArray<Zombie> mZombies;										  //+0x90
	DataArray<Plant> mPlants;										  //+0xAC
	DataArray<Projectile> mProjectiles;								  //+0xC8
	DataArray<Coin> mCoins;											  //+0xE4
	DataArray<LawnMower> mLawnMowers;								  //+0x100
	DataArray<GridItem> mGridItems;									  //+0x11C
	CursorObject *mCursorObject;									  //+0x138
	CursorPreview *mCursorPreview;									  //+0x13C
	MessageWidget *mAdvice;											  //+0x140
	SeedBank *mSeedBank;											  //+0x144
	GameButton *mMenuButton;										  //+0x148
	GameButton *mStoreButton;										  //+0x14C
	bool mIgnoreMouseUp;											  //+0x150
	ToolTipWidget *mToolTip;										  //+0x154
	Font *mDebugFont;												  //+0x158
	CutScene *mCutScene;											  //+0x15C
	Challenge *mChallenge;											  //+0x160

#if LAWN_DEBUG_TOOLS
	Zombie *mDebugSelectedZombie;
	Plant  *mDebugSelectedPlant;
#endif

	bool mPaused;													  //+0x164
	GridSquareType mGridSquareType[MAX_GRID_SIZE_X][MAX_GRID_SIZE_Y]; //+0x168
	int mGridCelLook[MAX_GRID_SIZE_X][MAX_GRID_SIZE_Y];				  //+0x240
	int mGridCelOffset[MAX_GRID_SIZE_X][MAX_GRID_SIZE_Y][2];		  //+0x318
	int mGridCelFog[MAX_GRID_SIZE_X][MAX_GRID_SIZE_Y + 1];			  //+0x4C8
	bool mEnableGraveStones;										  //+0x5C4
	int mSpecialGraveStoneX;										  //+0x5C8
	int mSpecialGraveStoneY;										  //+0x5CC
	float mFogOffset;												  //+0x5D0
	int mFogBlownCountDown;											  //+0x5D4
	PlantRowType mPlantRow[MAX_GRID_SIZE_Y];						  //+0x5D8
	int mWaveRowGotLawnMowered[MAX_GRID_SIZE_Y];					  //+0x5F0
	int mBonusLawnMowersRemaining;									  //+0x608
	int mIceMinX[MAX_GRID_SIZE_Y];									  //+0x60C
	int mIceTimer[MAX_GRID_SIZE_Y];									  //+0x624
	ParticleSystemID mIceParticleID[MAX_GRID_SIZE_Y];				  //+0x63C
	TodSmoothArray mRowPickingArray[MAX_GRID_SIZE_Y];				  //+0x654
	ZombieType mZombiesInWave[MAX_ZOMBIE_WAVES][MAX_ZOMBIES_IN_WAVE]; //+0x6B4
	bool mZombieAllowed[100];										  //+0x54D4
	int mSunCountDown;												  //+0x5538
	int mNumSunsFallen;												  //+0x553C
	int mShakeCounter;												  //+0x5540
	int mShakeAmountX;												  //+0x5544
	int mShakeAmountY;												  //+0x5548
	BackgroundType mBackground;										  //+0x554C
	int mLevel;														  //+0x5550
	int mSodPosition;												  //+0x5554
	int mPrevMouseX;												  //+0x5558
	int mPrevMouseY;												  //+0x555C
	int mSunMoney;													  //+0x5560
	int mNumWaves;													  //+0x5564
	int mMainCounter;												  //+0x5568
	int mEffectCounter;												  //+0x556C
	int mDrawCount;													  //+0x5570
	int mRiseFromGraveCounter;										  //+0x5574
	int mOutOfMoneyCounter;											  //+0x5578
	int mCurrentWave;												  //+0x557C
	int mTotalSpawnedWaves;											  //+0x5580
	TutorialState mTutorialState;									  //+0x5584
	ParticleSystemID mTutorialParticleID;							  //+0x5588
	int mTutorialTimer;												  //+0x558C
	int mLastBungeeWave;											  //+0x5590
	int mZombieHealthToNextWave;									  //+0x5594
	int mZombieHealthWaveStart;										  //+0x5598
	int mZombieCountDown;											  //+0x559C
	int mZombieCountDownStart;										  //+0x55A0
	int mHugeWaveCountDown;											  //+0x55A4
	bool mHelpDisplayed[NUM_ADVICE_TYPES];							  //+0x55A8
	AdviceType mHelpIndex;											  //+0x55EC
	bool mFinalBossKilled;											  //+0x55F0
	bool mShowShovel;												  //+0x55F1
	int mCoinBankFadeCount;											  //+0x55F4
	DebugTextMode mDebugTextMode;									  //+0x55F8
	bool mLevelComplete;											  //+0x55FC
	int mBoardFadeOutCounter;										  //+0x5600
	int mNextSurvivalStageCounter;									  //+0x5604
	int mScoreNextMowerCounter;										  //+0x5608
	bool mLevelAwardSpawned;										  //+0x560C
	int mProgressMeterWidth;										  //+0x5610
	int mFlagRaiseCounter;											  //+0x5614
	int mIceTrapCounter;											  //+0x5618
	int mBoardRandSeed;												  //+0x561C
	ParticleSystemID mPoolSparklyParticleID;						  //+0x5620
	ReanimationID mFwooshID[MAX_GRID_SIZE_Y][12];					  //+0x5624
	int mFwooshCountDown;											  //+0x5744
	int mTimeStopCounter;											  //+0x5748
	bool mDroppedFirstCoin;											  //+0x574C
	int mFinalWaveSoundCounter;										  //+0x5750
	int mCobCannonCursorDelayCounter;								  //+0x5754
	int mCobCannonMouseX;											  //+0x5758
	int mCobCannonMouseY;											  //+0x575C
	bool mKilledYeti;												  //+0x5760
	bool mMustacheMode;												  //+0x5761
	bool mSuperMowerMode;											  //+0x5762
	bool mFutureMode;												  //+0x5763
	bool mPinataMode;												  //+0x5764
	bool mDanceMode;												  //+0x5765
	bool mDaisyMode;												  //+0x5766
	bool mSukhbirMode;												  //+0x5767
	BoardResult mPrevBoardResult;									  //+0x5768
	int mTriggeredLawnMowers;										  //+0x576C
	int mPlayTimeActiveLevel;										  //+0x5770
	int mPlayTimeInactiveLevel;										  //+0x5774
	int mMaxSunPlants;												  //+0x5778
	uint32_t mStartDrawTime;										  //+0x577C
	uint32_t mIntervalDrawTime;										  //+0x5780
	int mIntervalDrawCountStart;									  //+0x5784
	float mMinFPS;													  //+0x5788
	int mPreloadTime;												  //+0x578C
	int mGameID;													  //+0x5790
	int mGravesCleared;
	int mPlantsEaten;
	int mPlantsShoveled;
	int mPlantsPlaced;
	int mCoinsCollected;
	int mDiamondsCollected;
	int mPottedPlantsCollected;
	int mChocolateCollected;
	int mPennyPincherStreak;
	bool mDontPeaUsedPeashooter;
	bool mGroundedUsedCatapult;
	bool mGoodMorningUsedNonFungus;
	bool mNoFungusUsedFungus;
	int mGargantuarsKillsByCornCob;

#if SEXY_USE_CONTROLLER
	float mGamepadX;
	float mGamepadY;
	float mVisualGamepadX;
	float mVisualGamepadY;
	bool mGamepadIgnoreChallenge;
	// Previous button states, used to detect press-once vs hold
	bool mGamepadPrevSouth;     // A
	bool mGamepadPrevEast;      // B
	bool mGamepadPrevWest;      // X
	bool mGamepadPrevNorth;     // Y
	bool mGamepadPrevStart;     // Start
	bool mGamepadPrevLShoulder; // LB
	bool mGamepadPrevRShoulder; // RB
	bool mGamepadPrevLTrigger;  // LT
	bool mGamepadPrevRTrigger;  // RT
	// D-Pad accumulators for cell-to-cell stepping (one step per press)
